app/controllers/api/v1/users_controller.rb

INSERT INTO "users" ("name", "email", "school", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Vignesh"], ["email", "vignesh@vakilsearch.com"], ["school", "9"], ["password", "test"], ["created_at", "2018-10-14 14:53:50.358946"], ["updated_at", "2018-10-14 14:53:50.358946"]]
---
    def register
        @user = User.new(user_params)
        if @user.save

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 AND "users"."password" = $2 LIMIT $3  [["email", "vignesh@vakilsearch.com"], ["password", "test"], ["LIMIT", 1]]
---
    def sign_in
        @user = User.find_by(email: params['email'], password: params['password'])

SELECT  "device_configs".* FROM "device_configs" WHERE "device_configs"."user_id" = $1 AND "device_configs"."auth_key" = $2 LIMIT $3  [["user_id", 3], ["auth_key", "nuMzRRJTZvt5oAcHRFdlRA88vj/z1Kk/qVQ7DVqoCXs="], ["LIMIT", 1]]
DELETE FROM "device_configs" WHERE "device_configs"."id" = $1  [["id", 2]]
---
    def sign_out
        @device_config = @user.device_configs.find_by(auth_key: params[:auth_key])
        if @device_config.destroy