app/controllers/application_controller.rb

    def authenticate_auth_key!
        user = DeviceConfig.find_by(auth_key: params['auth_key']).try(:user)
        if params['user_id'].present? && user.try(:id) == params['user_id']
---
SELECT  "device_configs".* FROM "device_configs" WHERE "device_configs"."auth_key" = $1 LIMIT $2  [["auth_key", "nuMzRRJTZvt5oAcHRFdlRA88vj/z1Kk/qVQ7DVqoCXs="], ["LIMIT", 1]]
SELECT  "device_configs".* FROM "device_configs" WHERE "device_configs"."auth_key" IS NULL LIMIT $1  [["LIMIT", 1]]