app/models/user.rb

    def gen_auth_key
        auth_key = SecureRandom.base64(32)
        DeviceConfig.create(user: self, auth_key: auth_key)
---
INSERT INTO "device_configs" ("auth_key", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["auth_key", "f2TdteBD582D4hg30O36a8MU+AzLLP6F2RIXXel6ECQ="], ["user_id", 3], ["created_at", "2018-10-14 14:55:10.854352"], ["updated_at", "2018-10-14 14:55:10.854352"]]